package com.example.playlistostdrama;

import java.util.ArrayList;

public class DataDummy {
    public static ArrayList<Drama> dummyDrama() {
        ArrayList<Drama> listDrama = new ArrayList<>();

        listDrama.add(
                new Drama(
                        "1",
                        "I Think I",
                        "2004",
                        "Full House",
                        "Byul",
                        "Song Hye Kyo, Rain, Han Da Gam, Kim Sung Soo, dll",
                        "그럴리 없다고 아닐꺼라고 믿었죠~ um-\n" +
                                "내가 그댈 사랑한단 이말도 안되죠~ um-\n" +
                                "괜한 질투일꺼라고 내가 외로운가보다고\n" +
                                "자신을 속여봤지만 이제 더는 난 감출수가없는걸요-\n" +
                                "I Think I Love You~\n" +
                                "그런가봐요-\n" +
                                "Cause I Miss You~\n" +
                                "그대만 없으면\n" +
                                "난 아무것도 못하고\n" +
                                "자꾸생각나고\n" +
                                "이런걸 보면 아무래도-\n" +
                                "I`m Falling For You~\n" +
                                "난 몰랐지만- Now I Need You~\n" +
                                "어느샌가 내 맘 깊은곳에\n" +
                                "아주 크게 자리잡은 그대의 모습을 이젠 보아요~\n" +
                                "\n" +
                                "\n" +
                                "우린 안어울린다고 친구 그게 딱 좋다고-um-\n" +
                                "하나부터 열개 도대체 뭐 한개라도 맞는게 없는데-\n" +
                                "어떻게사귈 수있냐고 말도안돼는얘기라고\n" +
                                "말하며 둘러 댔지만 이제더는 난 그러기가싫은걸요-\n" +
                                "I Think I Love You~\n" +
                                "그런가봐요-\n" +
                                "Cause I Miss You~\n" +
                                "그대만 없으면\n" +
                                "난 아무것도 못하고\n" +
                                "자꾸생각나고\n" +
                                "이런걸 보면 아무래도-\n" +
                                "I`m Falling For You~\n" +
                                "난 몰랐지만- Now I Need You~\n" +
                                "어느샌가 내 맘 깊은곳에\n" +
                                "아주 크게 자리잡은 그대의 모습을 이젠 보아요~\n" +
                                "왜 몰랐죠 그대라는걸Woo~\n" +
                                "왜 못봤죠 바로 앞인데~~Hoo~ye-\n" +
                                "그 동안 이렇게 바로 내곁에 있었는데\n" +
                                "왜 이제서야 사랑이 보이는건지~~Hoo-\n" +
                                "I Think I Love You~\n" +
                                "그런가봐요-\n" +
                                "Cause I Miss You~\n" +
                                "그대만 없으면\n" +
                                "난 아무것도 못하고\n" +
                                "자꾸생각나고\n" +
                                "이런걸 보면 아무래도-\n" +
                                "I`m Falling For You~\n" +
                                "난 몰랐지만- Now I Need You~\n" +
                                "어느샌가 내 맘 깊은곳에\n" +
                                "아주 크게 자리잡은 그대의 모습을 이젠 보아요\n",
                        R.drawable.fullhouse
                )
        );
        listDrama.add(
                new Drama(
                        "2",
                        "Perhaps Love",
                        "2006",
                        "Princess Hours",
                        "Eric Nam & Cheeze",
                        "Yoon Eun Hye, Ju Ji Hoon, Song Ji Hyo, Kim Jeong Hoon dll",
                        "언제였던걱지 기억나진 않아\n" +
                                "자꾸 내 머리가 너로 어지접던 시작\n" +
                                "한 두번씩 떠오르던 생각\n" +
                                "자꾸 늘어가서 조금 당황스러운 아 마음\n" +
                                "별일이 아닐수 있다고 사소한 마음 이라고\n" +
                                "내가 네게 자꾸 말을 하는게 어색한걸\n" +
                                "사랑인가요 그대 나와 같다면 시작인가요\n" +
                                "맘이 자꾸 그댈 사랑한대요\n" +
                                "온 세상이 듣도록 소리치네요\n" +
                                "왜 이제야 들리죠 우-\n" +
                                "서롤 만나기 위해 이제야 사랑 찾았다고\n" +
                                "지금 내 마음을 설명하려 해도\n" +
                                "니가 내가되어 맘을 느끼는 방법 뿐인데\n" +
                                "이미 난 니안에 있는 걸\n" +
                                "내 안에 니가 있듯이\n" +
                                "우린 서로에게 (우린 서소에게)\n" +
                                "이미 길들여진지 몰라\n" +
                                "사랑인가요 그대 나와 같다면\n" +
                                "시작인가요 맘이 자꾸 그댈 사장한대요\n" +
                                "온세상이 듣도록 소리치네요\n" +
                                "왜 이제야 들리죠 우-\n" +
                                "서롤 만나기 위해 이제야 사랑 찾았다고\n" +
                                "생각해보면 많은 순간속에\n" +
                                "얼마나 많은 설레임 있었는지\n" +
                                "조금 늦은 그만큼 난 더 잘해 줄께요\n" +
                                "함께 할께요 추억이 될 기억만 선물할께요\n" +
                                "다신 내곁에서 떠나지 마요\n" +
                                "짧은 순간조차도 불안한 걸요\n" +
                                "내게 머물러죄요 우-\n" +
                                "그댈 이렇게 많이 (그토록 많이)\n" +
                                "사랑하고 있어요 (그대 여야만) 이미 -",
                        R.drawable.princesshours
                )
        );
        listDrama.add(
                new Drama(
                        "3",
                        "Making A Lover",
                        "2009",
                        "Boys Before Flower",
                        "SS501",
                        "Lee Min Ho, Koo Hye Sun, Kim Hyun Joong, Kim Bum, Kim Joon",
                        "세상에 소리질러 I love you\n" +
                                "널 사랑한다고\n" +
                                "나의 여자가 되어 달라고\n" +
                                "눈부셔 Always you’re my star\n" +
                                "내가 널 지켜줄게\n" +
                                "I can always be waiting for you\n" +
                                "\n" +
                                "지친 하루의 끝에서\n" +
                                "날 웃게한 유일한 사람\n" +
                                "힘겨운 내 삶의 끝에서\n" +
                                "날 반겨준 단 한사람\n" +
                                "\n" +
                                "다시 하루를 시작해\n" +
                                "너의 예쁜 미소 떠올려\n" +
                                "난 누구보다 행복해\n" +
                                "너만 내곁에 있으면\n" +
                                "\n" +
                                "저 하늘에 I promise you\n" +
                                "내 모든걸 너에게 줄게\n" +
                                "\n" +
                                "세상에 소리질러 I love you 널 사랑한다고\n" +
                                "나의 여자가 되어 달라고\n" +
                                "눈부셔 Always you’re my star\n" +
                                "내가 널 지켜줄게\n" +
                                "I can always be waiting for you\n" +
                                "\n" +
                                "왜 이제서야 온거니\n" +
                                "온 세상을 가진것 같아\n" +
                                "고마워 나만의 천사\n" +
                                "처음처럼 널 사랑해\n" +
                                "\n" +
                                "저 하늘에 I promise you\n" +
                                "너의 모든걸 갖고 싶어\n" +
                                "\n" +
                                "세상에 소리질러 I love you 널 사랑한다고\n" +
                                "나의 여자가 되어 달라고\n" +
                                "눈부셔 Always you’re my star\n" +
                                "내가 널 지켜줄게\n" +
                                "I can always be waiting for you\n" +
                                "\n" +
                                "우리 하나만 약속해\n" +
                                "하늘에 걸고 맹세해\n" +
                                "태양이 불타 없어질\n" +
                                "그날까지 널 사랑해\n" +
                                "Oh my love\n" +
                                "\n" +
                                "기도해 날 허락 해주길\n" +
                                "너의 남자로 날 받아주길\n" +
                                "약속해 죽는 날까지\n" +
                                "내 마음 변치 않아\n" +
                                "I can always be waiting for you\n" +
                                "Baby I will forever with you\n" +
                                "영원히 너만을 사랑해",
                        R.drawable.boys
                )
        );
        listDrama.add(
                new Drama(
                        "4",
                        "Tears Are Falling",
                        "2011",
                        "49 Days",
                        "Shin Jae",
                        "Jung Il Woo, Nam Gyu Ri, Jo Hyun Jae, Lee Yo Won",
                        "니가 숨쉰다 니가 살고있다 내 가슴속에서\n" +
                                "심장이 울린다 니가 걷고있다 내 가슴속에서\n" +
                                "처음 내게 왔던 날부터 그리움이 되어 넌 나를 부른다\n" +
                                "\n" +
                                "자꾸 눈물이 난다 시린 눈물이 난다\n" +
                                "가슴 아파서 너 때문에 아파와서\n" +
                                "니가 그리운 날엔 이토록 그리운 날엔\n" +
                                "보고 싶어 또 눈물이 난다\n" +
                                "\n" +
                                "목이 메인다 끝내 삼켜낸다 사랑한단 그 말\n" +
                                "바람에 띄운다 멀리 보내본다 보고 싶단 그 말\n" +
                                "차마 전할 수가 없던 말 긴 한숨이 되어 가슴에 흐른다\n" +
                                "\n" +
                                "자꾸 눈물이 난다 시린 눈물이 난다\n" +
                                "가슴 아파서 너 때문에 아파와서\n" +
                                "니가 그리운 날엔 이토록 그리운 날엔\n" +
                                "보고 싶어 또 눈물이 난다\n" +
                                "\n" +
                                "자꾸 흘러내린다 니가 흘러내린다\n" +
                                "가슴에 차서 가슴에 니가 넘쳐서\n" +
                                "아픈 눈물이 된다 그리운 눈물이 된다\n" +
                                "내 가슴에 넌 그렇게 산다\n" +
                                "\n" +
                                "자꾸 눈물이 난다 시린 눈물이 난다\n" +
                                "사랑하니까 사랑은 눈물이니까\n" +
                                "너를 곁에 두고도 이렇게 곁에 두고도\n" +
                                "못다한 말 너를 사랑한다",
                        R.drawable.days
                )
        );
        listDrama.add(
                new Drama(
                        "5",
                        "Same",
                        "2017",
                        "My Secret Romance",
                        "Song Ji Eun",
                        "Sung hoon, Song Ji Eun, Kim Jae Young, Jeong Dasol",
                        "무엇이 무엇이 똑 같을까\n" +
                                "콩 콩 콩 사랑이 똑 같이 콩\n" +
                                "우리 둘은 만나면 콩 콩 콩\n" +
                                "양치를 할 때도 콩 콩 콩 콩\n" +
                                "떨어져 있을 땐 더 크게 콩\n" +
                                "너랑 나랑 또 무엇이 똑 같을까\n" +
                                "널 알고 싶어 혈액형 별자리\n" +
                                "그런 거 말고 진짜 너\n" +
                                "세상 누구도 모르는 너\n" +
                                "얘기해줄래 기억의 시작부터\n" +
                                "첫 번째 거짓말과\n" +
                                "첫 사랑 빼고 모두 알고 싶어\n" +
                                "무엇이 무엇이 다른 걸까\n" +
                                "이 빼기 일은 딱 일이지만\n" +
                                "너를 뺀 난 하나가 아닌걸\n" +
                                "널 보고 있을 땐 가슴 떨려\n" +
                                "보고 싶을 땐 막 가슴이 울려\n" +
                                "단 하나의 오직 하나가 되고 싶어\n" +
                                "널 알고 싶어 혈액형 별자리\n" +
                                "그런 거 말고 진짜 너\n" +
                                "세상 누구도 모르는 너\n" +
                                "얘기해줄래 기억의 시작부터\n" +
                                "첫 번째 거짓말과\n" +
                                "첫 사랑 빼고 모두 다\n" +
                                "내 별자린 상처투성이 별\n" +
                                "소심하고 외롭고 까칠해\n" +
                                "늘 혼자서 생각 하고\n" +
                                "혼자 상처받는 겁쟁이야\n" +
                                "날 읽어줄래 혈액형 별자리\n" +
                                "그런 거 말고 진짜 나\n" +
                                "세상 누구도 모르는 나\n" +
                                "얘기해줄게 기억의 시작부터\n" +
                                "첫 번째 거짓말과\n" +
                                "첫 사랑 빼고 모두 알려줄게",
                        R.drawable.mysecret
                )
        );
        listDrama.add(
                new Drama(
                        "6",
                        "Running",
                        "2020",
                        "Start Up",
                        "Gaho",
                        "Suzy, Nam Joo Hyuk, Kim SeonHo, Kang Hana",
                        "Breathe in 숨을 내쉬고\n" +
                                "두려움에 맞설 때\n" +
                                "내게 들려온 한 마디\n" +
                                "조금 더 힘을 내라고\n" +
                                "안개 속에 가려져\n" +
                                "한 줄기 빛도 없이\n" +
                                "고민하고 또 고민했었어\n" +
                                "오늘의 나를 위해서\n" +
                                "남과 다른 시선에\n" +
                                "또 다시 뒤쳐지는 그런 날들에\n" +
                                "반대로 나를 일으켜 달려 나가\n" +
                                "지금부터 시작해 봐 앞을 달려\n" +
                                "Running running 세상에 소리쳐\n" +
                                "막다른 길이 나타나도 난 괜찮아\n" +
                                "지금부터 시작해 봐 앞을 달려\n" +
                                "Running running 너와 함께라면\n" +
                                "뭐든 할 수 있어\n" +
                                "끝없이 달려봐 거친 세상 속\n" +
                                "삶이 나를 누르고\n" +
                                "점점 버거워질 때\n" +
                                "내게 건네온 그 손길\n" +
                                "한 번 더 일어나라고\n" +
                                "때론 울기도 하고\n" +
                                "때론 소리치지만\n" +
                                "내겐 절대로 지울 수 없는\n" +
                                "나만의 중심이 있어\n" +
                                "남과 다른 시선에\n" +
                                "또 다시 뒤쳐지는 그런 날들에\n" +
                                "반대로 나를 일으켜 달려 나가\n" +
                                "지금부터 시작해 봐 앞을 달려\n" +
                                "Running running 세상에 소리쳐\n" +
                                "막다른 길이 나타나도 난 괜찮아\n" +
                                "지금부터 시작해 봐 앞을 달려\n" +
                                "Running running 너와 함께라면\n" +
                                "뭐든 할 수 있어\n" +
                                "끝없이 달려봐 거친 세상 속\n" +
                                "서로에게 (서로에게) 빛이 되는 (빛이 되는)\n" +
                                "간절했던 꿈 하나\n" +
                                "칠흑 같던 (칠흑 같던) 밤하늘도 (밤하늘도)\n" +
                                "또 한 번 이겨내면 돼 달려 나가\n" +
                                "(달려 나가 I can be the one I want, ooh)\n" +
                                "(I love myself, wo-wo)\n" +
                                "잃어버린 나를 다시 찾을 거야\n" +
                                "Running running 너와 함께라면\n" +
                                "뭐든 할 수 있어\n" +
                                "바라던 곳에 닿을 그날을",
                        R.drawable.startup

                )
        );
        listDrama.add(
                new Drama(
                        "7",
                        "Will You Kiss Me",
                        "2010",
                        "Naughty Kiss",
                        "G.NA",
                        "Kim Hyun Joong, Jung So Min, Lee Si Young, Lee Tae Sung",
                        "언제부터였는지 너를 본 순간부터\n" +
                                "1분 1초마다 네가 자꾸 생각나\n" +
                                "너는 무얼 하는지 지금 어디 있는지\n" +
                                "Ooh baby\n" +
                                "이리저리 보아도 이것저것 따져도\n" +
                                "네가 자꾸 맘에 들어 미칠거 같애\n" +
                                "이런 내 맘을 아는지 이런 내 감정은 아는지\n" +
                                "하루하루 너만 바라보며 항상 기다려볼래\n" +
                                "오직 너 하나만 알고 사랑해 줄게\n" +
                                "사랑하기에도 아까운 시간인데\n" +
                                "너 없인 아무것도 하기 싫은데\n" +
                                "매일매일 아침마다 눈만 뜨면 보고 싶은데\n" +
                                "이제 너 없이는 하루라도 살 수 없는데\n" +
                                "사랑한다 그 한 마디 듣고 싶은데\n" +
                                "매일 사랑해 너만 사랑해 우리 둘이\n" +
                                "Ooh baby\n" +
                                "혹시 네가 내 거란 그런 상상만으로\n" +
                                "하루종일 두근거려 미칠거 같애\n" +
                                "너에게로 달려가 솔직하게 고백할거야\n" +
                                "하루하루 너만 바라보며 항상 기다려볼래\n" +
                                "오직 너 하나만 알고 사랑해 줄게\n" +
                                "사랑하기에도 아까운 시간인데\n" +
                                "너 없인 아무것도 하기 싫은데\n" +
                                "매일매일 아침마다 눈만 뜨면 보고 싶은데\n" +
                                "이제 너 없이는 하루라도 살수 없는데\n" +
                                "사랑한다 그 한 마디 듣고 싶은데\n" +
                                "매일 사랑해 너만 사랑해 우리 둘이\n" +
                                "말문이 막혀 숨이 차올라 (차올라)\n" +
                                "떨리는 내 손 꼭 잡은 네 두손에\n" +
                                "눈물이 날 것 같아 지금 내게 고백한 거니\n" +
                                "나만 항상 지켜주고 바라봐줄래\n" +
                                "너 때문에 눈물나면 꼭 안아줄래\n" +
                                "그토록 간절히 원하던 순간인데\n" +
                                "아무리 생각해도 믿기질 않아\n" +
                                "매일매일 내 옆에서 나만 보며 지켜봐줄래\n" +
                                "친구로 지내긴 너를 너무 사랑하니까\n" +
                                "사랑한단 그 한 마디 지금 해줄래\n" +
                                "매일 사랑해 나만 사랑해 키스해 줄래",
                        R.drawable.naughtykiss
                )
        );
        listDrama.add(
                new Drama(
                        "8",
                        "Another Day",
                        "2019",
                        "Hotel Del Luna",
                        "Monday Kiz & Punch",
                        "IU, Yoo Jin Goo, Lee Do Hyun",
                        "Another Day\n" +
                                "슬픈 말은 하지 말아요\n" +
                                "So far away\n" +
                                "아무 말도 하지 말아요\n" +
                                "사랑이 그렇게\n" +
                                "힘들게 하나요\n" +
                                "마음이 그렇게\n" +
                                "너만 찾고 있나요\n" +
                                "\n" +
                                "머리가 희미해\n" +
                                "아직도 넌\n" +
                                "가슴 깊은 곳에 사나 봐\n" +
                                "마음이 아파와\n" +
                                "지금도 난\n" +
                                "네가 보고 싶나 봐\n" +
                                "아프고 아파도\n" +
                                "널 바라볼 수 없잖아\n" +
                                "오늘도 이렇게\n" +
                                "그리우면 어떡해\n" +
                                "\n" +
                                "Another Day\n" +
                                "슬픈 말은 하지 말아요\n" +
                                "So far away\n" +
                                "아무 말도 하지 말아요\n" +
                                "사랑이 그렇게\n" +
                                "힘들게 하나요\n" +
                                "마음이 그렇게\n" +
                                "너만 찾고 있나요\n" +
                                "\n" +
                                "차가운 바람에\n" +
                                "너를 느껴\n" +
                                "두 눈을 감고 널 생각해\n" +
                                "좋았던 기억은\n" +
                                "간직할게\n" +
                                "가끔 꺼내어 볼게\n" +
                                "아프고 아파도\n" +
                                "널 바라볼 수 없잖아\n" +
                                "오늘도 이렇게\n" +
                                "보고 싶어 어떡해\n" +
                                "\n" +
                                "Another Day\n" +
                                "슬픈 말은 하지 말아요\n" +
                                "So far away\n" +
                                "아무 말도 하지 말아요\n" +
                                "사랑이 그렇게\n" +
                                "힘들게 하나요\n" +
                                "마음이 그렇게\n" +
                                "너만 찾고 있나요\n" +
                                "\n" +
                                "나를 붙잡아줘요\n" +
                                "놓지 마요\n" +
                                "제발 내 곁을 떠나지마\n" +
                                "\n" +
                                "우우우우 우우 우 우우\n" +
                                "왜 말을 못 해\n" +
                                "난 여기에 있는데\n" +
                                "우우우\n" +
                                "\n" +
                                "다시 만나면 네게 얘기할 거야\n" +
                                "너를 많이 사랑한다고\n" +
                                "매일 그렇게\n" +
                                "너를 기다리고 있을 거라고",
                        R.drawable.hotel

                )
        );
        listDrama.add(
                new Drama(
                        "9",
                        "Say Yes",
                        "2016",
                        "Moon Lovers",
                        "Loco & Punch",
                        "IU, Lee Joon Gi, Kang Ha Neul, Nam Joo Hyuk, Baekhyun, Jisoo, Hong Jong Hyun",
                        "니 눈앞에 왔잖아\n" +
                                "내가 여기 있잖아\n" +
                                "너의 입술로 말을 해줘\n" +
                                "say yes say yes\n" +
                                "나도 모르게\n" +
                                "너에게 가고 있나봐\n" +
                                "부는 바람에 내 맘 전할래\n" +
                                "love is true\n" +
                                "간지럽게만 느껴지던 눈 빛이\n" +
                                "이제는 익숙 하단듯이 웃음 짓지\n" +
                                "그 쪽으로 걸어가기만 하면 돼\n" +
                                "라고 친구들은\n" +
                                "계속해서 날 부추기지만\n" +
                                "아직은 무거운 구두의 뒷 굽\n" +
                                "차라리 벗어버리고\n" +
                                "싶은 이 밤의 끝\n" +
                                "손을 내밀어 줬으면 해\n" +
                                "맨발로 너에게\n" +
                                "뛰어갈 수 있게 끔\n" +
                                "복잡하기만한 하루에\n" +
                                "매 시간 머리를\n" +
                                "굴리지만 난\n" +
                                "지금에서야 깨달은 건데\n" +
                                "결국 다 버려지고\n" +
                                "너만 남아\n" +
                                "지난 봄에는\n" +
                                "널 우연히 봤고\n" +
                                "더 이상은 우연이\n" +
                                "아니였으면 해\n" +
                                "스치기만 했던\n" +
                                "너의 손을 잡고\n" +
                                "어떤 길이라도\n" +
                                "같이 걸었으면 해\n" +
                                "니 눈앞에 왔잖아\n" +
                                "내가 여기 있잖아\n" +
                                "너의 입술로 말을 해줘\n" +
                                "say yes say yes\n" +
                                "나도 모르게\n" +
                                "너에게 가고 있나봐\n" +
                                "부는 바람에 내 맘 전할래\n" +
                                "love is true\n" +
                                "i need u\n" +
                                "baby 너에게 하고 픈 말\n" +
                                "내가 못다한 말\n" +
                                "baby baby baby boy\n" +
                                "love is true\n" +
                                "어디든 갈 수 있어\n" +
                                "이건 거짓말이 아니야\n" +
                                "이제부터는 나의 옆이\n" +
                                "제일 편한 자리야\n" +
                                "입술을 오므리고\n" +
                                "내는 소리와 같이\n" +
                                "내 이름을\n" +
                                "불러줬음 좋겠어\n" +
                                "내가 뒤로 떨어져서\n" +
                                "걷더라도 단지\n" +
                                "이 목소리를\n" +
                                "들어줬음 좋겠어\n" +
                                "니 눈앞에 왔잖아\n" +
                                "내가 여기 있잖아\n" +
                                "너의 입술로 말을 해줘\n" +
                                "say yes say yes\n" +
                                "나도 모르게\n" +
                                "너에게 가고 있나봐\n" +
                                "부는 바람에 내 맘 전할래\n" +
                                "love is true\n" +
                                "내가 바라는 단 한가지\n" +
                                "니가 내곁에 있어주는 것\n" +
                                "니가 날 보며 웃어주는것도\n" +
                                "내 얘길 들어주는것도\n" +
                                "난 그걸로도 충분한데 you\n" +
                                "너를 보며 웃잖아\n" +
                                "두 눈이 말하잖아\n" +
                                "너도 이렇게 대답해줘\n" +
                                "say yes say yes\n" +
                                "너라서 좋아\n" +
                                "니가 날 울려도 좋아\n" +
                                "너는 나의 모든 전부니까\n" +
                                "love is true\n" +
                                "i need u\n" +
                                "baby 너에게 하고 픈 말\n" +
                                "내가 못다한 말\n" +
                                "baby baby baby boy\n" +
                                "love is true",
                        R.drawable.moonlover
                )
        );

        return listDrama;
    }

    public static Drama getDummyDetailDrama(String id) {
        ArrayList<Drama> listMovie = dummyDrama();
        Drama drama = null;

        for (int i = 0; i < listMovie.size(); i++) {
            if (listMovie.get(i).getId().equals(id)) {
                drama = listMovie.get(i);
            }
        }

        return drama;
    }


}
